vaca22/sdcard_file_server_esp32/main/main.c
                }

                ESP_LOGE("fuck","%s  %d  %d  %d   %d  %d  %d  %d",fuck,event->disc.rssi,
                         event->disc.addr.val[0],
                         event->disc.addr.val[1],
                         event->disc.addr.val[2],
                         event->disc.addr.val[3],
                         event->disc.addr.val[4],
                         event->disc.addr.val[5]
                );


            }

            /* Try to connect to the advertiser if it looks interesting. */
            //blecent_connect_if_interesting(&event->disc);
            return 0;

        case BLE_GAP_EVENT_CONNECT:
            /* A new connection was established or a connection attempt failed. */
            if (event->connect.status == 0) {
                /* Connection successfully established. */
                MODLOG_DFLT(INFO, "Connection established ");

                rc = ble_gap_conn_find(event->connect.conn_handle, &desc);
                assert(rc == 0);
                print_conn_desc(&desc);
                MODLOG_DFLT(INFO, "\n");

                /* Remember peer. */
                rc = peer_add(event->connect.conn_handle);
                if (rc != 0) {
                    MODLOG_DFLT(ERROR, "Failed to add peer; rc=%d\n", rc);
                    return 0;
                }

                /* Perform service discovery. */
                rc = peer_disc_all(event->connect.conn_handle,
                                   blecent_on_disc_complete, NULL);
                if (rc != 0) {
                    MODLOG_DFLT(ERROR, "Failed to discover services; rc=%d\n", rc);
                    return 0;
                }
            } else {
                /* Connection attempt failed; resume scanning. */
                MODLOG_DFLT(ERROR, "Error: Connection failed; status=%d\n",
                            event->connect.status);
                blecent_scan();
            }

            return 0;

        case BLE_GAP_EVENT_DISCONNECT:
            /* Connection terminated. */
            MODLOG_DFLT(INFO, "disconnect; reason=%d ", event->disconnect.reason);
            print_conn_desc(&event->disconnect.conn);
            MODLOG_DFLT(INFO, "\n");

            /* Forget about peer. */
            peer_delete(event->disconnect.conn.conn_handle);

            /* Resume scanning. */
            blecent_scan();
            return 0;

        case BLE_GAP_EVENT_DISC_COMPLETE:
            MODLOG_DFLT(INFO, "discovery complete; reason=%d\n",
                        event->disc_complete.reason);
            return 0;

        case BLE_GAP_EVENT_ENC_CHANGE:
            /* Encryption has been enabled or disabled for this connection. */
            MODLOG_DFLT(INFO, "encryption change event; status=%d ",
                        event->enc_change.status);
            rc = ble_gap_conn_find(event->enc_change.conn_handle, &desc);
            assert(rc == 0);
            print_conn_desc(&desc);
            return 0;

        case BLE_GAP_EVENT_NOTIFY_RX:
            /* Peer sent us a notification or indication. */
            MODLOG_DFLT(INFO, "received %s; conn_handle=%d attr_handle=%d "
                              "attr_len=%d\n",
                        event->notify_rx.indication ?
                        "indication" :
                        "notification",
                        event->notify_rx.conn_handle,
                        event->notify_rx.attr_handle,
                        OS_MBUF_PKTLEN(event->notify_rx.om));

            /* Attribute data is contained in event->notify_rx.om. Use
             * `os_mbuf_copydata` to copy the data received in notification mbuf */
            return 0;

        case BLE_GAP_EVENT_MTU:
            MODLOG_DFLT(INFO, "mtu update event; conn_handle=%d cid=%d mtu=%d\n",
                        event->mtu.conn_handle,
                        event->mtu.channel_id,
                        event->mtu.value);
            return 0;

        case BLE_GAP_EVENT_REPEAT_PAIRING:
            /* We already have a bond with the peer, but it is attempting to
             * establish a new secure link.  This app sacrifices security for
             * convenience: just throw away the old bond and accept the new link.
             */

            /* Delete the old bond. */
            rc = ble_gap_conn_find(event->repeat_pairing.conn_handle, &desc);
            assert(rc == 0);
            ble_store_util_delete_peer(&desc.peer_id_addr);

            /* Return BLE_GAP_REPEAT_PAIRING_RETRY to indicate that the host should
             * continue with the pairing operation.
             */
            return BLE_GAP_REPEAT_PAIRING_RETRY;

        default:
            return 0;
    }
}

static void
blecent_on_reset(int reason)
{
    MODLOG_DFLT(ERROR, "Resetting state; reason=%d\n", reason);
}

static void
blecent_on_sync(void)
{
    int rc;

    /* Make sure we have proper identity address set (public preferred) */
    rc = ble_hs_util_ensure_addr(0);
    assert(rc == 0);

    /* Begin scanning for a peripheral to connect to. */
    blecent_scan();
}

void blecent_host_task(void *param)
{
    ESP_LOGI(tag, "BLE Host Task Started");
    /* This function will return only when nimble_port_stop() is executed */
    nimble_port_run();

    nimble_port_freertos_deinit();
}












void app_main(void) {
    udpsock=NULL;
    s_wifi_event_group = xEventGroupCreate();
    setIo32();
    initDetectSD();
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES ||
        ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    //xTaskCreate(network_led_task, "network_led", 4096, NULL, 6, NULL);
    initEthernet();
    networkOK=false;
    xEventGroupWaitBits(s_wifi_event_group,
                        WIFI_CONNECTED_BIT,
                        pdFALSE,
                        pdFALSE,
                        portMAX_DELAY);

    networkOK=true;

    xTaskCreate(tcp_server_task, "tcp_server", 4096, (void*)AF_INET, 5, NULL);
    if(gpio_get_level(GPIO_INPUT_IO_0)==0){
        haveSD=1;
        gpio_isr_handler_remove(GPIO_INPUT_IO_0);
        sdcard_mount2();
    }else{
        haveSD=0;
    }
    int rc;
    ESP_ERROR_CHECK(esp_nimble_hci_and_controller_init());

    nimble_port_init();
    /* Configure the host. */
    ble_hs_cfg.reset_cb = blecent_on_reset;
    ble_hs_cfg.sync_cb = blecent_on_sync;
    ble_hs_cfg.store_status_cb = ble_store_util_status_rr;

    /* Initialize data structures to track connected peers. */
    rc = peer_init(MYNEWT_VAL(BLE_MAX_CONNECTIONS), 64, 64, 64);
    assert(rc == 0);

    /* Set the default device name. */
    rc = ble_svc_gap_device_name_set("nimble-blecent");
    assert(rc == 0);

    /* XXX Need to have template for store */
    ble_store_config_init();

    nimble_port_freertos_init(blecent_host_task);

    start_file_server();
    vEventGroupDelete(s_wifi_event_group);
}
